# coding=utf-8

##############################################
# 検索開始日(含む)
##############################################
search_start_date = '2008-02-01'


##############################################
# キーワード
##############################################
keyword_set_list = [
    # ##############################################
    # ##############################################
    # # キーワードリスト。この単位でcsvファイルに出力する
    # ##############################################
    # ##############################################
    # {
    #     ##############################################
    #     # キーワード
    #     ##############################################
    #     "JPEG": {
    #         ##############################################
    #         # 大文字小文字の区別をするかどうか
    #         #   False: しない
    #         #   True : する
    #         ##############################################
    #         "CaseSensitive": False,
    #
    #         ##############################################
    #         # EXACT & order match on exploit title
    #         #   False: しない
    #         #   True : する
    #         #      e.g. "WordPress 4.1" would not be detect "WordPress Core 4.1"
    #         ##############################################
    #         "Exect": False,
    #
    #         ##############################################
    #         # EXACT & order match on exploit title
    #         #   False: しない
    #         #   True : する
    #         #      e.g. "1.1" would not be detected in "1.0 < 1.3"
    #         ##############################################
    #         "Strict": False,
    #
    #         ##############################################
    #         # 検索対象をタイトルのみとするかどうか
    #         #   True : する
    #         #   False: しない
    #         ##############################################
    #         "Title": True,
    #
    #         ##############################################
    #         # 除外するワード
    #         #   e.g. ["term1, term2, term3"]
    #         ##############################################
    #         "ExculudeWord": ["aaaa", "bbbb"]
    #
    #     },
    #     ##############################################
    #     # キーワード　※複数キーワードはOR検索になります
    #     ##############################################
    #     "JPG": {
    #         "CaseSensitive": False,
    #         "Exect": False,
    #         "Strict": False,
    #         "Title": True,
    #         "ExculudeWord": []
    #     }
    # },

    ##############################################
    # キーワードリスト。この単位でcsvファイルに出力する
    ##############################################
    # {
    #     "Active Directory": {
    #         "CaseSensitive": False,
    #         "Exect": True,
    #         "Strict": False,
    #         "Title": True,
    #         "ExculudeWord": []
    #     },
    # },

    ##############################################
    # キーワードリスト。この単位でcsvファイルに出力する
    ##############################################
    # {
    #     "LDAP": {
    #         "CaseSensitive": True,
    #         "Exect": True,
    #         "Strict": False,
    #         "Title": True,
    #         "ExculudeWord": []
    #     },
    # },

    {
        "TLS": {
            "CaseSensitive": True,
            "Exect": False,
            "Strict": False,
            "Title": True,
            "ExculudeWord": []
        },
        "IPP": {
            "CaseSensitive": True,
            "Exect": False,
            "Strict": False,
            "Title": True,
            "ExculudeWord": []
        },
    },

    # {
    #     "PDF": {
    #         "CaseSensitive": True,
    #         "Exect": False,
    #         "Strict": False,
    #         "Title": True,
    #         "ExculudeWord": []
    #     },
    # },
]


##############################################
# 攻撃コードと判断するファイル種類(ダウンロード対象）
##############################################
source_ext = [
    ".c",
    ".cpp",
    ".java",
    ".md",
    ".php",
    ".pl",
    ".pm",
    ".py",
    ".rb",
    ".sh",
    ".xml",
]

module_ext = [
    ".zip",
    ".pdf",
]


##############################################
# 攻撃コードのダウンロードフォルダ　%DATE%は日付を表す
##############################################
# download_folder = "%DATE%"
download_folder = "攻撃データ"


##############################################
# html生成のみを行う
##############################################
html_only = {
    # 拡張子は不要
    # "csv": "20210429220335_-cetj LDAP ",
    # "html": "test4",
}
